Revit 2027 API
BendingDetailCustomFieldProperties.DiameterDimensionTypeId Property
 Identifies the Id of the diameter dimension type which is used to show dimensions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId DiameterDimensionTypeId { get; set; }
Public Property DiameterDimensionTypeId As ElementId
	Get
	Set
public:
property ElementId^ DiameterDimensionTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member DiameterDimensionTypeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The diameterDimensionTypeId should be an id of a diameter dimension type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace